Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_io_qspi.h
/*
; RP2350_io_qspi.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_io_qspi equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// IO_QSPI address definitions
// ---------------------------

typedef struct {
    volatile    uint32_t    USBPHY_DP_STATUS;
    volatile    uint32_t    USBPHY_DP_CTRL;
    volatile    uint32_t    USBPHY_DM_STATUS;
    volatile    uint32_t    USBPHY_DM_CTRL;
    volatile    uint32_t    GPIO_QSPI_SCLK_STATUS;
    volatile    uint32_t    GPIO_QSPI_SCLK_CTRL;
    volatile    uint32_t    GPIO_QSPI_SS_STATUS;
    volatile    uint32_t    GPIO_QSPI_SS_CTRL;
    volatile    uint32_t    GPIO_QSPI_SD0_STATUS;
    volatile    uint32_t    GPIO_QSPI_SD0_CTRL;
    volatile    uint32_t    GPIO_QSPI_SD1_STATUS;
    volatile    uint32_t    GPIO_QSPI_SD1_CTRL;
    volatile    uint32_t    GPIO_QSPI_SD2_STATUS;
    volatile    uint32_t    GPIO_QSPI_SD2_CTRL;
    volatile    uint32_t    GPIO_QSPI_SD3_STATUS;
    volatile    uint32_t    GPIO_QSPI_SD3_CTRL;
    volatile    uint32_t    RESERVED0[112];
    volatile    uint32_t    IRQSUMMARY_PROC0_SECURE;
    volatile    uint32_t    IRQSUMMARY_PROC0_NONSECURE;
    volatile    uint32_t    IRQSUMMARY_PROC1_SECURE;
    volatile    uint32_t    IRQSUMMARY_PROC1_NONSECURE;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_SECURE;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_NONSECURE;
    volatile    uint32_t    INTR;
    volatile    uint32_t    PROC0_INTE;
    volatile    uint32_t    PROC0_INTF;
    volatile    uint32_t    PROC0_INTS;
    volatile    uint32_t    PROC1_INTE;
    volatile    uint32_t    PROC1_INTF;
    volatile    uint32_t    PROC1_INTS;
    volatile    uint32_t    DORMANT_WAKE_INTE;
    volatile    uint32_t    DORMANT_WAKE_INTF;
    volatile    uint32_t    DORMANT_WAKE_INTS;
} IO_QSPI_TypeDef;

#ifdef __cplusplus
#define IO_QSPI_NS  reinterpret_cast<IO_QSPI_TypeDef *>(0x40030000U)
#define IO_QSPI_S   reinterpret_cast<IO_QSPI_TypeDef *>(0x40030000U)
#else
#define IO_QSPI_NS  ((IO_QSPI_TypeDef *)0x40030000U)
#define IO_QSPI_S   ((IO_QSPI_TypeDef *)0x40030000U)
#endif

// USBPHY_DP_STATUS Configuration

#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD                           (0x1U<<9)
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD                            (0x1U<<13)
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD                          (0x1U<<17)
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC                          (0x1U<<26)

// USBPHY_DP_CTRL Configuration

#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL                              (0x1FU<<0)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_0                            (0x1U<<0)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER                              (0x3U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_0                            (0x1U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER                               (0x3U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_0                             (0x1U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER                               (0x3U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_0                             (0x1U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER                              (0x3U<<28)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_0                            (0x1U<<28)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_UART1_TX                     (0x2U<<0)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_I2C0_SDA                     (0x3U<<0)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_SIOB_PROC_56                 (0x5U<<0)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_NULL                         (0x1FU<<0)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_NORMAL                       (0x0U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_INVERT                       (0x1U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_LOW                          (0x2U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_HIGH                         (0x3U<<12)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_NORMAL                        (0x0U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_INVERT                        (0x1U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_DISABLE                       (0x2U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_ENABLE                        (0x3U<<14)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_NORMAL                        (0x0U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_INVERT                        (0x1U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_LOW                           (0x2U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_HIGH                          (0x3U<<16)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_NORMAL                       (0x0U<<28)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_INVERT                       (0x1U<<28)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_LOW                          (0x2U<<28)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_HIGH                         (0x3U<<28)

// USBPHY_DM_STATUS Configuration

#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD                           (0x1U<<9)
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD                            (0x1U<<13)
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD                          (0x1U<<17)
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC                          (0x1U<<26)

// USBPHY_DM_CTRL Configuration

#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL                              (0x1FU<<0)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_0                            (0x1U<<0)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER                              (0x3U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_0                            (0x1U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER                               (0x3U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_0                             (0x1U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER                               (0x3U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_0                             (0x1U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER                              (0x3U<<28)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_0                            (0x1U<<28)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_UART1_RX                     (0x2U<<0)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_I2C0_SCL                     (0x3U<<0)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_SIOB_PROC_57                 (0x5U<<0)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_NULL                         (0x1FU<<0)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_NORMAL                       (0x0U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_INVERT                       (0x1U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_LOW                          (0x2U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_HIGH                         (0x3U<<12)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_NORMAL                        (0x0U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_INVERT                        (0x1U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_DISABLE                       (0x2U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_ENABLE                        (0x3U<<14)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_NORMAL                        (0x0U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_INVERT                        (0x1U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_LOW                           (0x2U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_HIGH                          (0x3U<<16)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_NORMAL                       (0x0U<<28)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_INVERT                       (0x1U<<28)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_LOW                          (0x2U<<28)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_HIGH                         (0x3U<<28)

