Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_io_qspi.h
// GPIO_QSPI_SD1_STATUS Configuration

#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD                       (0x1U<<9)
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD                        (0x1U<<13)
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD                      (0x1U<<17)
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC                      (0x1U<<26)

// GPIO_QSPI_SD1_CTRL Configuration

#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL                          (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_0                        (0x1U<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER                          (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_0                        (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER                           (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_0                         (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER                           (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_0                         (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER                          (0x3U<<28)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_0                        (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_XIP_SD1                  (0x0U<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_UART0_RX                 (0x2U<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_I2C0_SCL                 (0x3U<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_SIOB_PROC_61             (0x5U<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_NULL                     (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_NORMAL                   (0x0U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_INVERT                   (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_LOW                      (0x2U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_HIGH                     (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_NORMAL                    (0x0U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_INVERT                    (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_DISABLE                   (0x2U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_ENABLE                    (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_NORMAL                    (0x0U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_INVERT                    (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_LOW                       (0x2U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_HIGH                      (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_NORMAL                   (0x0U<<28)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_INVERT                   (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_LOW                      (0x2U<<28)
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_HIGH                     (0x3U<<28)

// GPIO_QSPI_SD2_STATUS Configuration

#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD                       (0x1U<<9)
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD                        (0x1U<<13)
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD                      (0x1U<<17)
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC                      (0x1U<<26)

// GPIO_QSPI_SD2_CTRL Configuration

#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL                          (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_0                        (0x1U<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER                          (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_0                        (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER                           (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_0                         (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER                           (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_0                         (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER                          (0x3U<<28)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_0                        (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_XIP_SD2                  (0x0U<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_UART0_CTS                (0x2U<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_I2C1_SDA                 (0x3U<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_SIOB_PROC_62             (0x5U<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_UART0_TX                 (0xBU<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_NULL                     (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_NORMAL                   (0x0U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_INVERT                   (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_LOW                      (0x2U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_HIGH                     (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_NORMAL                    (0x0U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_INVERT                    (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_DISABLE                   (0x2U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_ENABLE                    (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_NORMAL                    (0x0U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_INVERT                    (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_LOW                       (0x2U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_HIGH                      (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_NORMAL                   (0x0U<<28)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_INVERT                   (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_LOW                      (0x2U<<28)
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_HIGH                     (0x3U<<28)

// GPIO_QSPI_SD3_STATUS Configuration

#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD                       (0x1U<<9)
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD                        (0x1U<<13)
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD                      (0x1U<<17)
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC                      (0x1U<<26)

