Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_io_qspi.h
// GPIO_QSPI_SD3_CTRL Configuration

#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL                          (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_0                        (0x1U<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER                          (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_0                        (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER                           (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_0                         (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER                           (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_0                         (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER                          (0x3U<<28)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_0                        (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_XIP_SD3                  (0x0U<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_UART0_RTS                (0x2U<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_I2C1_SCL                 (0x3U<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_SIOB_PROC_63             (0x5U<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_UART0_RX                 (0xBU<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_NULL                     (0x1FU<<0)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_NORMAL                   (0x0U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_INVERT                   (0x1U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_LOW                      (0x2U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_HIGH                     (0x3U<<12)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_NORMAL                    (0x0U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_INVERT                    (0x1U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_DISABLE                   (0x2U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_ENABLE                    (0x3U<<14)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_NORMAL                    (0x0U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_INVERT                    (0x1U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_LOW                       (0x2U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_HIGH                      (0x3U<<16)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_NORMAL                   (0x0U<<28)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_INVERT                   (0x1U<<28)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_LOW                      (0x2U<<28)
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_HIGH                     (0x3U<<28)

// IRQSUMMARY_PROC0_SECURE Configuration

#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP                   (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM                   (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK              (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS                (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0               (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1               (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2               (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3               (0x1U<<7)

// IRQSUMMARY_PROC0_NONSECURE Configuration

#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP                (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM                (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK           (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS             (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0            (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1            (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2            (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3            (0x1U<<7)

// IRQSUMMARY_PROC1_SECURE Configuration

#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP                   (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM                   (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK              (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS                (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0               (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1               (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2               (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3               (0x1U<<7)

// IRQSUMMARY_PROC1_NONSECURE Configuration

#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP                (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM                (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK           (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS             (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0            (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1            (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2            (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3            (0x1U<<7)

// IRQSUMMARY_DORMANT_WAKE_SECURE Configuration

#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP            (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM            (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK       (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS         (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0        (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1        (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2        (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3        (0x1U<<7)

// IRQSUMMARY_DORMANT_WAKE_NONSECURE Configuration

#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP         (0x1U<<0)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM         (0x1U<<1)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK    (0x1U<<2)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS      (0x1U<<3)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0     (0x1U<<4)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1     (0x1U<<5)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2     (0x1U<<6)
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3     (0x1U<<7)

