Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_io_qspi.h
// PROC1_INTE Configuration

#define IO_QSPI_PROC1_INTE_USBPHY_DP_LEVEL_LOW                      (0x1U<<0)
#define IO_QSPI_PROC1_INTE_USBPHY_DP_LEVEL_HIGH                     (0x1U<<1)
#define IO_QSPI_PROC1_INTE_USBPHY_DP_EDGE_LOW                       (0x1U<<2)
#define IO_QSPI_PROC1_INTE_USBPHY_DP_EDGE_HIGH                      (0x1U<<3)
#define IO_QSPI_PROC1_INTE_USBPHY_DM_LEVEL_LOW                      (0x1U<<4)
#define IO_QSPI_PROC1_INTE_USBPHY_DM_LEVEL_HIGH                     (0x1U<<5)
#define IO_QSPI_PROC1_INTE_USBPHY_DM_EDGE_LOW                       (0x1U<<6)
#define IO_QSPI_PROC1_INTE_USBPHY_DM_EDGE_HIGH                      (0x1U<<7)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SCLK_LEVEL_LOW                 (0x1U<<8)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SCLK_LEVEL_HIGH                (0x1U<<9)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SCLK_EDGE_LOW                  (0x1U<<10)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SCLK_EDGE_HIGH                 (0x1U<<11)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SS_LEVEL_LOW                   (0x1U<<12)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SS_LEVEL_HIGH                  (0x1U<<13)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SS_EDGE_LOW                    (0x1U<<14)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SS_EDGE_HIGH                   (0x1U<<15)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD0_LEVEL_LOW                  (0x1U<<16)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD0_LEVEL_HIGH                 (0x1U<<17)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD0_EDGE_LOW                   (0x1U<<18)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD0_EDGE_HIGH                  (0x1U<<19)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD1_LEVEL_LOW                  (0x1U<<20)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD1_LEVEL_HIGH                 (0x1U<<21)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD1_EDGE_LOW                   (0x1U<<22)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD1_EDGE_HIGH                  (0x1U<<23)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD2_LEVEL_LOW                  (0x1U<<24)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD2_LEVEL_HIGH                 (0x1U<<25)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD2_EDGE_LOW                   (0x1U<<26)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD2_EDGE_HIGH                  (0x1U<<27)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_LEVEL_LOW                  (0x1U<<28)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_LEVEL_HIGH                 (0x1U<<29)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_LOW                   (0x1U<<30)
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH                  (0x1U<<31)

// PROC1_INTF Configuration

#define IO_QSPI_PROC1_INTF_USBPHY_DP_LEVEL_LOW                      (0x1U<<0)
#define IO_QSPI_PROC1_INTF_USBPHY_DP_LEVEL_HIGH                     (0x1U<<1)
#define IO_QSPI_PROC1_INTF_USBPHY_DP_EDGE_LOW                       (0x1U<<2)
#define IO_QSPI_PROC1_INTF_USBPHY_DP_EDGE_HIGH                      (0x1U<<3)
#define IO_QSPI_PROC1_INTF_USBPHY_DM_LEVEL_LOW                      (0x1U<<4)
#define IO_QSPI_PROC1_INTF_USBPHY_DM_LEVEL_HIGH                     (0x1U<<5)
#define IO_QSPI_PROC1_INTF_USBPHY_DM_EDGE_LOW                       (0x1U<<6)
#define IO_QSPI_PROC1_INTF_USBPHY_DM_EDGE_HIGH                      (0x1U<<7)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SCLK_LEVEL_LOW                 (0x1U<<8)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH                (0x1U<<9)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SCLK_EDGE_LOW                  (0x1U<<10)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SCLK_EDGE_HIGH                 (0x1U<<11)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SS_LEVEL_LOW                   (0x1U<<12)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SS_LEVEL_HIGH                  (0x1U<<13)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SS_EDGE_LOW                    (0x1U<<14)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SS_EDGE_HIGH                   (0x1U<<15)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD0_LEVEL_LOW                  (0x1U<<16)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD0_LEVEL_HIGH                 (0x1U<<17)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD0_EDGE_LOW                   (0x1U<<18)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD0_EDGE_HIGH                  (0x1U<<19)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD1_LEVEL_LOW                  (0x1U<<20)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD1_LEVEL_HIGH                 (0x1U<<21)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD1_EDGE_LOW                   (0x1U<<22)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD1_EDGE_HIGH                  (0x1U<<23)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD2_LEVEL_LOW                  (0x1U<<24)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD2_LEVEL_HIGH                 (0x1U<<25)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD2_EDGE_LOW                   (0x1U<<26)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD2_EDGE_HIGH                  (0x1U<<27)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD3_LEVEL_LOW                  (0x1U<<28)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD3_LEVEL_HIGH                 (0x1U<<29)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD3_EDGE_LOW                   (0x1U<<30)
#define IO_QSPI_PROC1_INTF_GPIO_QSPI_SD3_EDGE_HIGH                  (0x1U<<31)

// PROC1_INTS Configuration

#define IO_QSPI_PROC1_INTS_USBPHY_DP_LEVEL_LOW                      (0x1U<<0)
#define IO_QSPI_PROC1_INTS_USBPHY_DP_LEVEL_HIGH                     (0x1U<<1)
#define IO_QSPI_PROC1_INTS_USBPHY_DP_EDGE_LOW                       (0x1U<<2)
#define IO_QSPI_PROC1_INTS_USBPHY_DP_EDGE_HIGH                      (0x1U<<3)
#define IO_QSPI_PROC1_INTS_USBPHY_DM_LEVEL_LOW                      (0x1U<<4)
#define IO_QSPI_PROC1_INTS_USBPHY_DM_LEVEL_HIGH                     (0x1U<<5)
#define IO_QSPI_PROC1_INTS_USBPHY_DM_EDGE_LOW                       (0x1U<<6)
#define IO_QSPI_PROC1_INTS_USBPHY_DM_EDGE_HIGH                      (0x1U<<7)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SCLK_LEVEL_LOW                 (0x1U<<8)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH                (0x1U<<9)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SCLK_EDGE_LOW                  (0x1U<<10)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SCLK_EDGE_HIGH                 (0x1U<<11)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SS_LEVEL_LOW                   (0x1U<<12)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SS_LEVEL_HIGH                  (0x1U<<13)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SS_EDGE_LOW                    (0x1U<<14)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SS_EDGE_HIGH                   (0x1U<<15)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD0_LEVEL_LOW                  (0x1U<<16)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD0_LEVEL_HIGH                 (0x1U<<17)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD0_EDGE_LOW                   (0x1U<<18)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD0_EDGE_HIGH                  (0x1U<<19)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD1_LEVEL_LOW                  (0x1U<<20)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD1_LEVEL_HIGH                 (0x1U<<21)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD1_EDGE_LOW                   (0x1U<<22)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD1_EDGE_HIGH                  (0x1U<<23)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD2_LEVEL_LOW                  (0x1U<<24)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD2_LEVEL_HIGH                 (0x1U<<25)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD2_EDGE_LOW                   (0x1U<<26)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD2_EDGE_HIGH                  (0x1U<<27)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD3_LEVEL_LOW                  (0x1U<<28)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD3_LEVEL_HIGH                 (0x1U<<29)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD3_EDGE_LOW                   (0x1U<<30)
#define IO_QSPI_PROC1_INTS_GPIO_QSPI_SD3_EDGE_HIGH                  (0x1U<<31)

